Repository: 84000/data-translation-memory
Catalog: Toh_357-The_Prophecy_on_Mount_Gosrnga-v.2.tmx
Source language: bo
Languages: en

source: ཡུལ་འདི་ནི་སངས་རྒྱས་འབྱུང་བ་རེ་རེའི་ཚེ་ཡང་འབྱུང་ཞིང་རྒྱས་པར་འགྱུར་རོ། །
en: “Each time a buddha appears, this land will appear and flourish.

source: ཅིའི་ཕྱིར་ཡུལ་གཞན་དང་གཞན་དག་གི་ནི་ཞིག་ནས་ཡུན་རིང་མོ་ཞིག་ཏུ་སྟོང་ཞིང་དགོན་པར་འདུག་ལ་
en: Why is it that, while other lands deteriorate and then remain empty and desolate for a long time,

source: ཡུལ་དགེ་བ་ནི་སངས་རྒྱས་འབྱུང་བ་རེ་རེའི་ཚེ་མི་རྣམས་ཀྱིས་བརྒྱན་ཅིང་མཛེས་པར་འགྱུར་ཞེ་ན
en: [Why is it that, while other lands deteriorate and then remain empty and desolate for a long time,] the land Virtue is adorned and beautified by people each time a buddha appears?

source: འདི་ལྟར་ཡུལ་འདི་ནི་ཐུབ་པ་དྲང་སྲོང་ཆེན་པོའི་གནས།
en: It is because this land is the dwelling place of the saintly great sage,

source: དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་ཞེས་བྱ་བ་རི་གླང་རུ་དང་ཉེ་བ་ཆུ་བོ་གོ་མའི་འགྲམ་ན་ཡོད་པའི་ཕྱིར་རོ། །
en: [It is because this land is the dwelling place of the saintly great sage,] the domain of the thus-gone ones, the locale of the Gomasalaganda stūpa, which is near Mount Gośṛṅga and on the banks of the River Goma.

source: མཆོད་རྟེན་འདི་མདོ་སྡེའི་ནང་ནས་ནི་མིང་གོ་མ་ས་ལ་གན་ད་ཞེས་བྱའི།
en: This stūpa is called Gomasalaganda in the sūtras.

source: འཇིག་རྟེན་ཕལ་གྱི་ཐ་སྙད་དུ་ནི་ཆུ་བོ་གོ་མའི་འགྲམ་ཞེས་བྱ་བར་འདོགས་པར་འགྱུར་ཏེ
en: In ordinary parlance, however, it is called ‘On the Bank of River Goma.’

source: འདི་ལྟར་ཇི་སྲིད་དུ་མཆོད་རྟེན་ཆུ་བོ་གོ་མའི་འགྲམ་ཞེས་བྱ་བ་དང་། འོད་སྲུང་གི་མཆོད་རྟེན་འདི་གཉིས་རྒྱས་ཤིང་མཆོད་གནས་སུ་བྱེད་པ་དེ་སྲིད་དུ་ནི་ཡུལ་དགེ་བ་ཡང་རྒྱས་ཤིང་བཟང་པོར་འགྱུར་རོ། །
en: Thus, for as long as that stūpa called On the Bank of River Goma, as well as Kāśyapa’s stūpa, flourish and are sites of worship, the land of Virtue will also flourish and prosper.

source: ནམ་མཆོད་རྟེན་འདི་གཉིས་རྒུད་པ་དེའི་ཚེ་ཡུལ་ཡང་རྒུད་ཅིང་སྟོངས་པར་འགྱུར་རོ། །
en: Whenever these two stūpas fall into decline, this land will also fall into decline and become empty.”

source: དེ་ནས་དེའི་ཚེ་འཁོར་དེར་འདུས་པའི་ལྷ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་གསུང་དེ་ཐོས་ནས་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་དང་། རི་གླང་རུ་ལ་དད་པ་དང་གུས་པ་ཆེན་པོ་རྙེད་དེ
en: Having heard the Blessed One’s explanation, the retinue of gods gathered there gained great faith and veneration for the Gomasalaganda stūpa and Mount Gośṛṅga.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་མགོ་བོས་ཕྱག་འཚལ་སྐྱབས་སུ་སོང་ནས་
en: They bowed down to the Blessed Buddha and went to him to take refuge. Then,

source: སྤྱན་སྔར་འདི་སྐད་དུ་བདག་ཅག་ཀྱང་དུས་དེའི་ཚེ་ཡུལ་འདིར་རིགས་མཐོན་པོར་སྐྱེས་ནས་བདེ་བར་གཤེགས་པའི་བསྟན་པ་སྲུང་ཞིང་། ཡུལ་ཆོས་ཀྱི་བཀའ་ཁྲིམས་མི་ཉམས་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་བོ། །
en: in the Blessed One’s presence they made this aspiration: “At that time, may we take birth in that land within eminent families and guard the Well-Gone One’s teaching so that the righteous laws of the land never weaken!”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་རྒྱལ་པོ་རྣམ་ཐོས་ཀྱི་བུ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདུ་ཤེས་ཅན་ཞེས་བྱ་བ་དང་། ལྷའི་ལྷ་མི་ཕམ་པ་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་ཁྱིམ་འཚིག་ཅེས་བྱ་བ་དང་། ལྷ་ནམ་མཁའི་དབྱངས་ཞེས་བྱ་བ་དང་། ལྷ་གསེར་གྱི་ཕྲེང་བ་ཅན་ཞེས་བྱ་བ་དང་། ལྷ་མོ་ལྕགས་ཀྱུ་ཅན་ཞེས་བྱ་བ་དང་། ལྷ་མོ་གནས་ཅན་ཞེས་བྱ་བ་རྣམས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: At that moment the Blessed One addressed the divine king Vaiśravaṇa, the bodhisattva great being Perceptive, the god of gods Ajita, the nāga king Gṛhadāha, the god Song of the Sky, the god Golden Garland, the goddess Hook Bearer, and the goddess Stable:

source: རིགས་ཀྱི་བུ་ཁྱེད་རྣམས་ལ་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་དང་། རི་གླང་རུ་ཡུལ་དང་བཅས་པ་དང་། ངའི་བསྟན་པ་དང་། སྲས་རྣམས་ཡོངས་སུ་གཏད་ཀྱིས་
en: “Noble children, I entrust to you the Gomasalaganda stūpa, Mount Gośṛṅga and its land, together with my teachings and my offspring.

source: ཡོངས་སུ་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། བསྐྱང་བ་དང་། མཆོད་གནས་སུ་འགྱུར་བར་གྱིས་ཤིག །
en: Be sure to guard them, protect them, nurture them, and pay homage to them!

source: ཡུལ་འདིའི་རྒྱལ་པོ་དང་། ཡུལ་འཛིན་པའི་བློན་པོ་དང་། སྦྱིན་བདག་ཆོས་དང་འཐུན་པ་རྣམས་ཀྱང་ཡོངས་སུ་གཏད་ཀྱིས་
en: I entrust to you the monarchs of this land, the governing ministers, and all the patrons who act in accord with the Dharma.

source: དེ་བཞིན་དུ་གྱིས་ཤིག །
en: Protect them accordingly!

source: རི་གླང་རུ་ལུང་བསྟན་པའི་མདོ་འདི་ཡང་ཡོངས་སུ་གཏད་ཀྱིས་འཕེལ་ཞིང་རྒྱས་པར་གྱིས་ཤིག །
en: I also entrust to you this discourse that describes Mount Gośṛṅga, so you must propagate and spread it!

source: གང་གི་ཚེ་ཡུལ་འདི་མེའམ་ཆུའམ་ཕ་རོལ་གྱི་དམག་གིས་ཉེན་ཅིང་ཕོངས་པར་གྱུར་པ་ན་
en: If at some point this land is endangered and ravaged by fire, water, or foreign armies,

source: མདོ་འདི་བཀླག་པ་དང་། ཁ་ཏོན་དང་། མཆོད་པ་དང་། བསམ་པ་དང་། བསྒོམ་པ་བྱས་ན་
en: if you read this discourse, or recite it, pay homage to it, reflect upon it, and meditate upon it,

source: དེས་ན་ཡུལ་དེའི་གནོད་པ་ཞི་བར་འགྱུར་རོ། །
en: the destructive forces afflicting this land will be pacified.

source: མ་འོངས་པའི་དུས་ན་སེམས་ཅན་རྣམས་ཀྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ཡུལ་འདིར་སུམ་པ་རྣམས་དང་བོད་རྣམས་འོང་བར་འགྱུར་གྱིས་
en: “In the future, due to the ripening of sentient beings’ former actions, the Sumpa and Tibetan people will come to this land.

source: དེའི་ཚེ་མདོ་འདི་ལྷོགས་ཤིག་དང་།
en: At that time, you must propound this discourse, for

source: མདོ་འདི་ཐོས་ནས་མདོ་འདིའི་མཐུ་དང་། ལྷ་རྣམས་ཀྱི་བྱིན་གྱིས་དད་པ་མེད་པ་དེ་རྣམས་ཡུལ་འཇིག་པར་མི་བྱེད་ཅིང་ཡིད་ཀྱང་འགྱོད་པར་འགྱུར་རོ། །
en: when they hear this discourse, then through its inherent power and the blessings of the gods, those faithless people will not devastate the land but rather feel remorse.

source: མ་འོངས་པའི་དུས་ན་ཡུལ་འདིར་རྒྱ་རྣམས་ཀྱང་འོང་བར་འགྱུར་གྱིས་
en: In the future, the Chinese will also come to this land.

source: མདོ་འདི་ཐོས་ནས་དད་པ་སྐྱེ་བར་འགྱུར་རོ། །
en: upon hearing it, they will give rise to faith,

source: དད་པའི་སྟོབས་ཀྱིས་ཡུལ་མི་འཇིག་ཅིང་ཕྱིར་ཞིང་བསྲུང་བ་དང་།
en: and through the strength of their faith, they will not inflict any harm on this land. Rather, they will grant it protection and

source: བསོད་ནམས་བྱ་བའི་དངོས་པོ་ཡང་བྱེད་པར་འགྱུར་ཏེ།
en: engage in meritorious deeds.

source: རྒྱུ་དེས་ན་མདོ་འདི་ནི་ཡུལ་ལ་ཕན་འདོགས་པར་བྱེད་པ་ཡིན་ནོ། །
en: This being so, this discourse will be of benefit for this land.

source: མདོ་འདིའི་ཕན་ཡོན་གཞན་ཡང་མང་དུ་ཡོད་དེ་
en: There are so many other benefits of this discourse, but

source: ཡུན་ཐུང་ངུས་ནི་བརྗོད་པར་མི་ནུས་སོ། །
en: it is not possible to mention them all in a short time.

source: དེའི་ཕྱིར་མདོ་འདི་ཁྱེད་རྣམས་ལ་ཡོངས་སུ་གཏད་དོ། །
en: Therefore, I entrust this discourse to you.”

source: དེ་ནས་དེའི་ཚེ་རྣམ་ཐོས་ཀྱི་བུ་ལ་སོགས་པ་ལྷ་རྣམས་དང་། ཀླུའི་རྒྱལ་པོ་དང་། ལྷ་མོ་དེ་དག་ཐམས་ཅད་འཁོར་དང་བཅས་ཏེ་ལངས་ནས་
en: Vaiśravaṇa and the other gods, the nāga king, and the goddesses together with their retinues stood up.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་པུས་མོའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: They kneeled down before the Blessed One and

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: with their palms joined, exclaimed,

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་བཀའ་སྤྱི་བོས་ལེན་པར་འཚལ་ལོ། །
en: “Respected Blessed One, we place the Blessed One’s commandment on the crown of our heads!”

source: ཡང་གསོལ་པ།
en: They then continued,

source: སྟོན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་སྐད་བཀའ་སྩལ་པ་བཞིན་དུ་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་དང་། རི་གླང་རུ་ཡུལ་དང་བཅས་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་བསྲུང་བར་འཚལ།
en: “Just as the Teacher, the Blessed One, has instructed, we will guard the Gomasalaganda stūpa, Mount Gośṛṅga, and its land.

source: བདེ་བར་གཤེགས་པའི་བསྟན་པ་དང་ཆོས་དང་འཐུན་པའི་རྒྱལ་པོ་དང་། རབ་ཏུ་བྱུང་བ་དང་། ཆོས་དང་འཐུན་པར་ཡུལ་འཛིན་པ་དང་། ཆོས་དང་འཐུན་པའི་སྦྱིན་བདག་དང་། གང་ཞིག་བསོད་ནམས་བྱ་བའི་དངོས་པོ་བགྱིད་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་བསྲུང་བར་ནི་འཚལ་ན
en: We will guard the Well-Gone One’s teaching, the monarchs who act in accord with the Dharma, those who have gone forth, governors who act in accord with the Dharma, patrons who act in accord with the Dharma, and all those engaged in meritorious deeds.

source: བཅོམ་ལྡན་འདས་ཇི་སྲིད་དུ་ཡུལ་འདིར་དཀོན་མཆོག་གསུམ་མཆོད་གནས་སུ་བགྱིད་པ་དང་།
en: Blessed One, for as long as the Three Jewels are venerated in this land and

source: ཡུལ་འཛིན་པས་ཀྱང་ཆོས་དང་འཐུན་པར་ཡུལ་སྐྱོང་ཞིང་ཆོས་དང་མི་འཐུན་པའི་སེམས་ཅན་རྣམས་ཀྱི་མགོན་མི་བགྱིད་པ་དེ་སྲིད་དུ་ནི་
en: for as long as the governors rule the land in accord with the Dharma and do not protect those who act in ways contrary to the Dharma,

source: བདག་ཅག་གིས་ཡོངས་སུ་བསྲུང་བར་རྔོ་ཐོགས་ཏེ
en: we will be able to guard this land.

source: མདོ་འདི་ཡང་ལི་ཡུལ་ཡུན་རིང་དུ་གནས་པར་བགྱི་བའི་སླད་དུ་
en: To ensure that this discourse may remain in the land of Khotan for a long time,

source: ལི་ཡུལ་ལས་ཉི་འོག་ཏུ་གྱུར་པའི་རྒྱལ་པོ་དང་། བློན་པོ་རྣམས་ལ་མདོ་སྡེ་འདི་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་ལི་ཡུལ་གྱི་ཆེད་དུ་རི་གླང་རུ་ལ་བཤད་པ་ཡིན་ནོ་ཞེས་རྣར་གྲགས་པར་བགྱི།
en: we will make sure that the kings and ministers in the border regions surrounding Khotan hear that the Blessed One has taught this discourse at Mount Gośṛṅga for the benefit of the land of Khotan.

source: སུག་པར་ཐོབ་པར་བགྱི། སེམས་བསྒྱུར་བར་བགྱིའོ། །
en: We will make sure that they receive it in their hands and that their minds are transformed.

source: བཅོམ་ལྡན་འདས་ནམ་ཡུལ་འདིར་དཀོན་མཆོག་གསུམ་མཆོད་གནས་སུ་མི་བགྱིད་ཅིང་།
en: “Blessed One, when the Three Jewels are no longer venerated in this land and

source: ཆོས་དང་མི་འཐུན་པ་རྣམས་ཀྱི་མགོན་ལྷག་པར་བགྱིད་པ་དེའི་ཚེ་
en: when those who act in ways contrary to the Dharma are protected here,

source: བདག་ཅག་རྣམས་ཀྱི་གཟི་བརྗིད་དང་མཐུ་སྟོབས་ཉམས་པར་འགྱུར་བས་ཡུལ་འདིའི་ཆེད་དང་བསྲུང་བར་ནི་རྔོ་མི་ཐོགས་སོ། །
en: our splendor and might will decline so that we are no longer able to guard this land.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why?

source: བདག་ཅག་གི་མཐུ་སྟོབས་དང་གཟི་བརྗིད་ནི་བདེ་བར་གཤེགས་པའི་བསྟན་པ་དང་།
en: Because our might and splendor grow from the Well-Gone One’s teaching, from

source: ཆོས་དང་འཐུན་པར་ཡུལ་ཚུལ་བཞིན་དུ་སྐྱོང་བ་དང་།
en: [our might and splendor grow from the Well-Gone One’s teaching, from] the land being correctly governed in accord with the Dharma, and from

source: བསོད་ནམས་བྱ་བའི་དངོས་པོ་དགེ་བའི་རྩ་བའི་མཐུས་འཕེལ་བར་འགྱུར་བ་ལགས་སོ། །
en: [our might and splendor grow from the Well-Gone One’s teaching, from the land being correctly governed in accord with the Dharma, and from] the roots of virtue engendered through meritorious deeds.”

source: དེ་ནས་དེའི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གདན་ལས་བཞེངས་ནས་
en: Right then, the Blessed Buddha rose from his seat and

source: རི་གླང་རུའི་སྟེང་གི་འགྲམ་ནས་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་གང་ན་བ་དེ་ལོགས་སུ་གཟིགས་ནས
en: from the edge of the peak of Mount Gośṛṅga he gazed toward the Gomasalaganda stūpa.

source: ཡང་ནས་ཡང་དུ་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་རི་གླང་རུ་དང་བཅས་པ་ལན་གཉིས་ལན་གསུམ་གྱི་བར་དུ་བྱིན་གྱིས་བརླབས་ནས་
en: Repeatedly—twice, thrice—he blessed the Gomasalaganda stūpa, the domain of the thus-gone ones, as well as Mount Gośṛṅga and the whole region.

source: ལི་ཡུལ་ཐམས་ཅད་དང་། མཚོའི་ནང་ན་གནས་པའི་སེམས་ཅན་གྲངས་མེད་པ་རྣམས་ལ་འོད་ཟེར་དང་ཐུགས་རྗེ་ཆེན་པོས་ཁྱབ་པར་མཛད་དེ
en: He thus suffused the entire land of Khotan and all the countless beings dwelling in the lake there with light rays and great compassion.

source: འོད་ཟེར་དེ་དང་ཐུགས་རྗེ་ཆེན་པོ་དེས་ཆུ་ན་གནས་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་ནི་ཞི་བར་འགྱུར།
en: The light rays and his great compassion quelled all the sufferings of those beings dwelling in the water,

source: ཁྲོ་བ་དང་འཁོན་དུ་འཛིན་པ་དང་ནི་བྲལ་ཏེ།
en: freed them from anger and resentment,

source: བྱམས་པའི་སེམས་དང་ལྡན་པར་གྱུར་ཅིང་
en: imbued them with loving kindness, and

source: ལྷའི་བདེ་བ་དང་ལྡན་ནས་
en: endowed them with the happiness of the gods.

source: སྐད་ཅིག་དེ་ཉིད་ལ་སེམས་ཅན་དེ་དག་ལས་གྲངས་མེད་པ་ཞིག་ཚེ་འཕོས་ནས་ལྷ་དང་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་ཏེ
en: In that very instant, an uncountable number of those beings changed lives and were reborn as gods and humans.

source: སངས་རྒྱས་ཉིད་དུ་འགྱུར་བའི་ས་བོན་རྙེད་ཅིང་
en: They acquired the seed for awakening, and

source: བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: their progress toward awakening became irreversible.

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷ་རྣམས་ལ་ལན་གསུམ་གྱི་བར་དུ་བོས་ནས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then called out to the gods three times and addressed them thus:

source: རིགས་ཀྱི་བུ་ཁྱེད་ཀྱིས་དམ་བཅས་པ་རྣམས་ནི་བརྩོན་འགྲུས་མེད་པར་མི་འགྲུབ་བོ། །
en: “Noble children, these pledges of yours will not be fulfilled without perseverance.

source: རིགས་ཀྱི་བུ་ངས་བསྐལ་པ་གྲངས་མེད་པ་གསུམ་གྱི་བར་དུ་དཀའ་བ་སྤྱད་པའི་བསྟན་པ་འདི་དང་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་ཡུལ་དང་བཅས་པ་ཁྱེད་རྣམས་ལ་ཡོངས་སུ་གཏད་ཀྱིས་
en: Noble children, I entrust to you this teaching of mine for which I underwent hardships for three countless eons. I also entrust to you the Gomasalaganda stūpa and its land.

source: ཡོངས་སུ་སྲུངས་ཤིག །
en: Guard them closely.

source: ཁྱེད་རྣམས་ལས་གང་ཞིག་གིས་ང་རྗེས་སུ་དྲན་ཞིང་གཟུངས་ཡོད་པ་དང་། བསྟན་པ་བསྲུང་བ་དེས་ནི་
en: All of you, in whatever you do, should recall me, retain and protect the teachings, and thereby

source: བསྟན་པ་འདི་ལ་རབ་ཏུ་བྱུང་བ་རྣམས་ཡོངས་སུ་བསྲུང་བར་གྱིས་ཤིག །
en: closely guard all those who have taken ordination under this teaching.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why, you may wonder?

source: མི་ཁྱིམ་པ་ལ་ལ་ཞིག་ལོ་བརྒྱའི་བར་དུ་ཉིན་རེ་ཞིང་དགེ་བའི་རྩ་བ་བསོད་ནམས་ཆེན་པོ་བྱེད་ལ།
en: Some householders might gather roots of virtue and create vast amounts of merit each day for a hundred years, yet

source: འགའ་ཞིག་ཉིན་གཅིག་རབ་ཏུ་བྱུང་ནས་བསྟན་པ་ལ་གནས་ན་སྔ་མས་ཕྱི་མའི་བསོད་ནམས་ཀྱི་བརྒྱའི་ཆར་ཡང་མི་ཆོག་གོ། །
en: this would not amount to even one percent of the merit of someone who abides by the teachings for just a single day after going forth.

source: སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཐམས་ཅད་ཀྱང་སྔར་ཁྱིམ་གྱི་གནས་སྤངས་ཏེ་རབ་ཏུ་བྱུང་ནས་
en: Because all of the buddhas, who are equal in number to the grains of sand in the Ganges River, have first given up their life as householders and gone forth, and

source: སྤྱོད་ལམ་དེ་ཉིད་ཀྱིས་བྱང་ཆུབ་ཆེན་པོ་བརྙེས་སོ། །
en: attained awakening through that lifestyle.

source: ང་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་ཏེ།
en: “I too—having completed the six perfections,

source: ས་བཅུ་བརྙེས་ནས་སྲིད་པ་ཐ་མའི་ཚེ་ན་མ་ཕྱེད་ན་
en: attained the tenth level, and entered my last life in cyclic existence—

source: རྒྱལ་པོའི་ཁབ་ནས་བྱུང་སྟེ་ནགས་ཚལ་དུ་གཤེགས་སོ། །
en: left the royal compound at midnight and went to the forest.

source: ནགས་ཚལ་ནས་བཞོན་པ་རྒྱལ་པོ་ཡབ་ཀྱི་ཐོག་ཏུ་དཀྲི་ནས་
en: From the forest I sent my mount to my father, the king.

source: རང་གི་སྐྲ་རལ་གྲིས་བྲེགས་ཏེ།
en: I then cut off my hair with my sword and

source: ངའི་གོས་གྱ་ནོམ་པ་རིན་ཐང་མེད་པ་རྔོན་པ་དེ་དག་ལས་ཆོས་གོས་ངུར་སྨྲིག་ཏུ་བརྗེས་སོ། །
en: gave hunters my fine, priceless clothes in exchange for saffron-colored Dharma robes.

source: ངས་ཆོས་གོས་དེ་གྱོན་ནས་དུས་གསུམ་གྱི་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་སྐྱབས་སུ་སོང་ནས་
en: Donning those Dharma robes, I paid homage to all the buddhas of the three times, went to them for refuge, and then

source: རབ་ཏུ་བྱུང་བའི་སྤྱོད་ལམ་བཟུང་བ་དང་
en: assumed the lifestyle of one who has gone forth.

source: !ལྷ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་སྐྱབས་སུ་སོང་ནས་ཕྱི་བཞིན་དུ་འབྲང་ངོ་། །
en: All of the gods then paid homage to me, went to me for refuge, and followed my lead.

source: ང་ཡང་སྤྱོད་ལམ་དེ་ཉིད་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བརྙེས་སོ། །
en: Thus, I too attained perfect awakening through that lifestyle.

source: དེའི་ཕྱིར་བདེ་བར་གཤེགས་པའི་བསྟན་པ་ནི་དམ་པ་ཡིན་པར་ཤེས་པར་བྱའོ། །
en: For this reason, understand that the Well-Gone One’s teaching is sublime.

source: རབ་ཏུ་བྱུང་བ་ནི་བསོད་ནམས་དང་ལྡན་པར་ཤེས་པར་བྱའོ། །
en: Understand that to go forth is to possess merit.

source: འཇིག་རྟེན་ན་རབ་ཏུ་བྱུང་བས་ཐོབ་པ་མ་གཏོགས་པར་ཁྱིམ་པའི་ཆ་ལུགས་ཀྱིས་དགྲ་བཅོམ་པའམ། རང་སངས་རྒྱས་སམ། བླ་ན་མེད་པའི་བྱང་ཆུབ་ཐོབ་པ་ནི་སུས་ཀྱང་མ་ཐོས་མ་མཐོང་ངོ་། །
en: In this world it has never been seen or heard that someone with the trappings of a householder attained the states of a worthy one, a self-realized buddha, or unsurpassable awakening; such states are only attained by going forth.

source: རབ་ཏུ་བྱུང་བའི་སྤྱོད་ལམ་དམ་པ་འདི་ནི་འཇིག་རྟེན་ན་ལྷ་ལ་སོགས་པ་ཐམས་ཅད་ཀྱི་མཆོད་གནས་ཡིན་ནོ། །
en: The sublime lifestyle of one who has gone forth is an object of veneration by all the gods and others in this world.”

source: དེ་ནས་དེའི་ཚེ་ལྷ་དང་ལྷ་མོ་དེ་ཐམས་ཅད་སྟན་ལས་ལངས་ནས་དབྱངས་གཅིག་ཏུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: All of the gods and goddesses now rose from their seats and pledged to the Blessed Buddha in unison,

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་ལྟར་བཀའ་སྩལ་པ་བཞིན་འཚལ་ཞིང་
en: “Respected Blessed One, we will do as the Blessed One has instructed.

source: བསམས་བཞིན་དུ་ནི་བཀའ་ལས་འགལ་བ་མི་འཚལ་ལོ། །
en: We will not intentionally transgress your instructions.

source: ཡུལ་འདི་སངས་རྒྱས་ཀྱིས་བསྟན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་མཆོད་རྟེན་དང་བཅས་པ་ཡང་ཀུན་དུ་བསྲུང་བ་དང་། བསྐྱང་བ་དང་། རྗེས་སུ་གཟུང་བར་འཚལ་གྱིས།
en: Here in this land we will fully guard, nurture, and uphold the Buddha’s teaching and the stūpa that is the domain of the thus-gone ones.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་བདག་ཅག་རྣམས་ལ་མཐུ་བསྟང་དུ་གསོལ།
en: Blessed One, please endow us with strength!

source: མ་འོངས་པ་རྩོད་པའི་དུས་ན་བྱིན་གྱིས་བརླབས་བརླབས་པའི་ཡུལ་འདིར་དགྲ་མང་པོ་དང་། མ་དད་པ་དང་། ཕྱིར་རྒོལ་བ་བདེ་བར་གཤེགས་པའི་བསྟན་པ་ལ་དད་པའི་ཁྱད་པར་མི་རྙེད་ཅིང་། བསྟན་པ་གཞིག་པའི་སླད་དུ་བརྩོན་པ་དག་འབྱུང་བའི་སླད་དུའོ། །
en: Because in the future age of conflict, many enemies, faithless people, and adversaries who have yet to gain the special quality of faith in the Well-Gone One’s teaching will come to this blessed land and persistently attempt to destroy the teaching.”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷ་དེ་དག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ།
en: The Blessed One then expressed his approval to the gods, saying,

source: སྐྱེས་བུ་དམ་པ་རྣམས་ལེགས་སོ་ལེགས་སོ། །
en: “Sublime beings, excellent! Excellent!

source: ངས་ཀྱང་ཡུལ་འདི་བྱིན་གྱིས་བརླབས་ཟིན་ཏེ། བྱིན་གྱིས་བརླབས་པ་དེ་ཉིད་ཀྱིས་མཚམས་བཅད་པ་ཡང་ཡིན་ནོ། །
en: I have blessed this land and due to those blessings its boundaries have been secured.

source: མ་འོངས་པ་རྩོད་པའི་དུས་ན་ཡུལ་འདི་གཞོམ་པའི་ཕྱིར་སུམ་པའི་དམག་ཕལ་མོ་ཆེ་དང་། གྲུ་གུ་རུས་སྣ་ཚོགས་དང་། ཧོར་དང་། གཞན་ཡང་དད་པ་མེད་པ་དག་འོང་བར་འགྱུར་ཏེ
en: In the future age of conflict, great armies of the Sumpa people, different clans of Drugu people, people from Hor, and other faithless people will come to destroy this land.

source: དེའི་ཚེ་ཡུལ་གཞན་དང་གཞན་དག་ནས་དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་བྱིན་གྱིས་བརླབས་པ་དག་ཡུལ་འདིར་གཤེགས་ནས་
en: At that time, blessed images of thus-gone ones will arrive here from other lands and

source: ཡུལ་གྱི་ས་མཚམས་བསྲུང་བར་མཛད་དེ།
en: they will guard the land’s borders.

source: བསོད་ནམས་ཀྱི་སྟོབས་དེས་ན་ཡུལ་འདི་གཏན་བརླག་པར་མི་འགྱུར་རོ། །
en: Through the strength of that merit, this land will never be completely destroyed.

source: གཟུགས་བརྙན་དེ་དག་གི་ཕྱི་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དང་། ལྷ་དང་། ཀླུ་མཐུ་སྟོབས་དང་ལྡན་པ་མང་པོ་དག་འོང་ཞིང་ཡུལ་ཡུལ་དུ་གནོད་པ་རྣམས་ཟློག་པར་བྱེད།
en: Many bodhisattvas, gods, and mighty nāgas will follow these images and they will help avert harm in many regions.

source: དགྲ་རྣམས་ཀྱིས་ཡུལ་མི་ཆོམས་པར་བྱེད་དེ།
en: Enemies will be unable to destroy the land.

source: བདེ་བ་ཅན་ཞེས་བྱ་བའི་མཁར་ནས་དེ་བཞིན་གཤེགས་པ་བདེ་བའི་འབྱུང་གནས་ཞེས་བྱ་བའི་གཟུགས་བརྙན་གཤེགས་ནས་
en: From Blissful Castle an image of the thus-gone Source of Bliss will appear.

source: ནུབ་ཕྱོགས་མཁར་ཀོ་ཤེད་དུ་བཞུགས་ཤིང་ཡུལ་གྱི་ས་མཚམས་བསྲུང་བར་འགྱུར་རོ། །
en: It will then reside at Koshé Castle and thereby guard the borders of the land.

source: བྱང་ཕྱོགས་ཡུལ་ཤེ་ན་ཞ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་ཤེ་ན་ཞ་ཞེས་བྱ་བ་སའི་འོག་ནས་འབྱུང་བར་འགྱུར་ཞིང་ཡུལ་གྱི་ས་མཚམས་བསྲུང་བར་འགྱུར་རོ། །
en: In the northern lands, an image called Shenazha of the thus-gone Shenazha will emerge from underground and guard the land’s borders.

source: དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་ཀིའུ་ལང་ཞེས་བྱ་བར་གཤེགས་ནས་ཤར་ཕྱོགས་ཡུལ་ཕྱེ་མ་ཞེས་བྱ་བའི་མཁར་དུ་ཞུགས་ཤིང་ཡུལ་གྱི་ས་མཚམས་བསྲུང་བར་འགྱུར་རོ། །
en: An image of the Thus-Gone One, called Kiulang, will appear and reside in the eastern region at Sand Castle and guard the land’s borders.

source: དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་ཕྱི་སེ་ཞེས་བྱ་བ་གཤེགས་ནས། བྱང་ཕྱོགས་ཀྱི་རི་གླང་རུ་ལ་འོད་སྲུང་གི་མཆོད་རྟེན་གྱི་དྲུང་དུ་བཞུགས་ཤིང་
en: An image of the Thus-Gone One, called Chisé, will appear and remain in front of Kāśyapa’s stūpa on Mount Gośṛṅga in the north.

source: དགེ་སློང་དགོན་པ་པ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་བསྐྱེད་ཅིང་། དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་དང་། ཡུལ་གྱི་ས་མཚམས་བསྲུང་བར་འགྱུར་རོ། །
en: It will generate roots of virtue for the monks living in hermitages there and will guard the Thus-Gone One’s teaching and the land’s borders.

source: མཁར་དགེ་བ་ཅན་ཞེས་བྱ་བའི་ནང་ན་ཚོང་འདུས་ཀ་ས་དི་ཟེ་ཞེས་བྱ་བར་དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་རྒྱལ་པོའི་ཕོ་བྲང་གནས་ཞེས་བྱ་བ་བཞུགས་ཤིང་མཁར་དགེ་བ་ཡུལ་དང་བཅས་པའི་ས་མཚམས་བསྲུང་བར་འགྱུར་རོ། །
en: In Virtuous Castle, an image of the Thus-Gone One, called Abiding in the Royal Palace, will remain in the Kasadizé market and guard Virtuous Castle and the borders of its land.

source: ས་གཞི་ཉོ་མོ་ཉ་ཞེས་བྱ་བ་གང་དུ་རྒྱལ་པོ་ཡོ་ལ་ཞེས་བྱ་བ་ས་མཁར་བརྩིག་པའི་གྲོས་བྱེད་པར་འགྱུར་བ་
en: King Yola will discuss plans to build a castle on the land called Nyomonya.

source: དེར་དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་ཅུ་གོན་པ་ན་ཞེས་བྱ་བ་བཞུགས་ཤིང་མཁར་དགེ་བ་ཅན་ཞེས་བྱ་བ་ཡུལ་དང་བཅས་པའི་ས་མཚམས་བསྲུང་བར་འགྱུར་རོ། །
en: There, an image of the Thus-Gone One, called Chugönpana, will abide and guard Virtuous Castle and the borders of its land.

source: གཙུག་ལག་ཁང་དི་ན་ཛྱ་ཞེས་བྱ་བར་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱི་གཟུགས་བརྙན་ཐོར་ཁོང་དུ་བྱས་པ་གཤེགས་པར་འགྱུར་ཏེ།
en: “In Dinadzya Temple a cast image of the thus-gone Dīpaṅkara will arrive.

source: གཟུགས་བརྙན་དེ་ནི་འཛམ་བུའི་གླིང་གི་གཟུགས་བརྙན་ཐོར་ཁོང་དུ་བྱས་པ་ཐམས་ཅད་ཀྱི་ཐོག་མར་འབྱུང་བ་ཡིན་ནོ། །
en: This image will be the first cast image made in Jambudvīpa.

source: གཟུགས་བརྙན་དེ་ལ་མི་རྣམས་ཀྱིས་ནི་མཚན་བཀོར་བའི་མར་མེ་མཛད་ཅེས་བྱ་བར་འདོགས་པར་འགྱུར་ཏེ།
en: People will name this image ‘the circulating Dīpaṅkara.’

source: དེ་ནི་ལི་ཡུལ་གྱི་གཟུགས་བརྙན་ཐོར་ཁོང་དུ་བྱེད་པ་ཐམས་ཅད་ཀྱི་དཔེར་འབྱུང་ཞིང་།
en: It will become an example for all other cast images made throughout Khotan and

source: བདེ་བར་གཤེགས་པའི་བསྟན་པ་ཡུལ་དང་བཅས་པ་ཡོངས་སུ་བསྲུང་བར་འགྱུར་རོ། །
en: it will guard the Well-Gone One’s teaching and the land.

source: གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་མང་གི་གཟུགས་བརྙན་ཡུལ་འདིའི་དབུས་སུ་གཤེགས་ནས་ཕྱོགས་བཅུའི་མཚམས་གཅད་པར་མཛད་དེ།
en: Moreover, an image of the thus-gone Prabhūtaratna will come to the center of the land and secure the boundaries in all ten directions.

source: ཇི་སྲིད་དུ་དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་ཕྱོགས་ཕྱོགས་ན་བཞུགས་པ་དེ་དག་མཆོད་གནས་སུ་བྱེད་པ་དེ་སྲིད་དུ་ཡུལ་འདི་བརླག་པར་མི་འགྱུར་རོ། །
en: For as long as images of the thus-gone ones abide in the various directions and are venerated, this land will not be destroyed.

source: ཡུལ་འདི་ནས་སྐྱེས་པའི་མིའམ། ཡུལ་གཞན་ནས་སྐྱེས་པའི་མི་ལ་ལ་ཞིག་དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་དེ་དག་ལ་སྙིང་ཐག་པ་ནས་དད་པ་དང་གུས་པ་དང་རབ་ཏུ་དང་བར་བྱེད་ཅིང་།
en: If the people born in this land, or people from other lands feel heartfelt faith and devotion for these images of the thus-gone ones, feel deeply inspired by them, and

source: འདི་སྙམ་དུ་བདེ་བར་གཤེགས་པའི་གཟུགས་བརྙན་འདི་དག་ནི་ཡུལ་འདི་བསྲུང་བའི་སླད་དུ་གཤེགས་སོ་སྙམ་དུ་ཡང་སེམས་ན།
en: think, “These images of the thus-gone ones have come here to guard this land,”

source: གཟུགས་བརྙན་དེ་དག་ཀྱང་སངས་རྒྱས་བཞུགས་པ་བཞིན་དུ་དོན་མཛད་པར་འགྱུར་རོ། །
en: the images will benefit them as if they were the Buddha in person.

source: གཟུགས་བརྙན་དེ་དག་ང་དང་དུས་གསུམ་དུ་གཏོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་ཕྱིར་རོ། །
en: Because these images are blessed by me and by all the buddhas of the three times.

source: གཞན་ཡང་ཡུལ་འདིར་ངའི་གཟུགས་བརྙན་ཆེན་པོ་ཤིང་རྟས་འདྲེན་པ་བྱས་ཏེ།
en: “Furthermore, a large image of me will be brought to this land by chariot.

source: མཁར་དགེ་བ་ཅན་ཞེས་བྱ་བའི་ནང་དུ་བཞག་ནས་མཆོད་གནས་ཆེན་པོར་བྱེད་པར་འགྱུར་རོ། །
en: It will be installed in Virtuous Castle and be taken as a major object of veneration.
